<html>

<link rel="stylesheet"  href="css.css">
<head>
<title>25 задание ЕГЭ</title>
  <ul class="menu-main">
  <li><a href="index.html" >Главная</a></li>
  <li><a href="Mask.html">Маски</a></li>
  <li><a href="delitel.html" class="current">Делители</a></li>
  <li><a href="Numbers.html">Задания</a></li>
  <li><a href="Info.html">Источники информации</a></li>
  </head>
</ul>
<body bgcolor="#3b3934">
  <ul class="main-text">
 <h1 align="center">Делители</h1>
 <h2>В данном прототипе 25 задания требуется найти или является ли число простым , или числа у которых определённое колличество делителей</h2>
 <h2>Рассмотрим пример данного задания</h2>
 <h3>
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [185 311; 185 330], числа, имеющие ровно четыре различных натуральных делителя. Для каждого найденного числа запишите эти четыре делителя в четыре соседних столбца на экране с новой строки. Делители в строке должны следовать в порядке возрастания
<p>Например, в диапазоне [12; 14] ровно четыре различных натуральных делителя имеет число 14, поэтому для этого диапазона вывод на экране должна содержать следующие значения:
<p>1 2 7 14

  </p>
</h3>
 <h3>Решим задачу перебором. Будем проверять количество делителей каждого числа из диапазона, если их количество равно четырём  — записываем их в массив d. После этого выводим эти делители на экран в новой строке.
 <pre>for num in range(185311, 185331):
    deliteli = []
    for d in range(1, int(num**0.5) + 1):
        if num % d == 0:
            deliteli.append(d)
            if num//d != d:
                deliteli.append(num//d)
    if len(deliteli) == 4:
        deliteli.sort()
        print(deliteli[0],deliteli[1],deliteli[2],deliteli[3])</pre>
 Ответом на данное задание будет являтся список
 <p>1 2 92657 185314
<p>1 47 3943 185321
<p>1 241 769 185329</p>
 </p></h3>

</body>
</html>
