<html>
  <body>
<h1>Маски</h1>
<h2>Для решения данного подтипа в Python используется библиотека Fnmatch
Что бы его ввести используем команду from fnmacth import fnmatch .
Сама команда работает так:
                          fnmatch(str,mask)
Где str-строка которую надо проверить на подобие, a mask-маска на которую надо проверять.
Так же для проверки используется перебор с оптимизацией.</h2>
<h1>Разберём ДЕМО 2023 Года:
Назовём маской числа последовательность цифр, в которой также могут
встречаться следующие символы:
– символ «?» означает ровно одну произвольную цифру;
– символ «*» означает любую последовательность цифр произвольной
длины; в  том числе «*» может задавать и пустую последовательность.
Например, маске 123*4?5 соответствуют числа 123405 и 12300405.
Среди натуральных чисел, не превышающих 10 10, найдите все числа,
соответствующие маске 1?2139*4, делящиеся на 2023 без остатка.
В ответе запишите в первом столбце таблицы все найденные числа
в порядке возрастания, а во втором столбце – соответствующие им
результаты деления этих чисел на 2023.
Количество строк в таблице для ответа избыточно.</h1>
from fnmatch import fnmatch
cnt=0
for i in range(1021615,10**10+1,2023):
        if fnmatch(str(i),'1?2139*4') and i%2023==0:
            print(i,i//2023)
            cnt+=1
            if cnt==10:break
            
Так же есть альтернативный вариант решения данного задания:
s = []
list_c2 = [""] + list(str(n) for n in range(1000)) + \
            list("0" + str(n) for n in range(100)) + \
            list("00" + str(n) for n in range(10))
for x in "0123456789":
  for y in list_c2:
    n = int(f"1{x}2139{y}4")
    if n % 2023 == 0:
       s.append(n)
s.sort()
for n in s:
  print( n, n // 2023 )
  </body>
</html>
