<html>
   <link rel="stylesheet"  href="css.css">
<head>
<title>25 задание ЕГЭ</title>
  <ul class="menu-main">
  <li><a href="index.html">Главная</a></li>
  <li><a href="Mask.html" >Маски</a></li>
  <li><a href="delitel.html">Делители</a></li>
  <li><a href="Numbers.html" class="current">Задания</a></li>
  <li><a href="Info.html">Источники информации</a></li>
  </ul>  
  </head>
  <body bgcolor="#3b3934">
     <ul class="main-text">
         <h3>
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [174457; 174505], числа, имеющие ровно два различных натуральных делителя, не считая единицы и самого числа. Для каждого найденного числа запишите эти два делителя в два соседних столбца на экране с новой строки в порядке возрастания произведения этих двух делителей. Делители в строке также должны следовать в порядке возрастания.
<p>Например, в диапазоне [5; 9] ровно два различных натуральных делителя имеют числа 6 и 8, поэтому для этого диапазона вывод на экране должна содержать следующие значения:
<p>2 3
<p>2 4
        </p>
<div class="spravca"><input type="checkbox" id="hd-1" class="reference"/>
<label for="hd-1" >Ответ и Решение</label> 
<span class="story">
Решим задачу перебором. Будем проверять количество делителей каждого числа из диапазона, если их количество равно двум  — записываем их в массив d.
Пример решения в Python:
<pre> for x in range(174457,174505+1):
    k=0
    s=[]
    for y in range(2,x//2+1):
        if x%y==0:
            k+=1
            s.append(y)
            if k>2:
                break
    if k==2:
        print(*s)</pre>
</span>

<div>
</h3>
<h2>Номер 2</h2>
<h3>Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [312614; 312651], числа, имеющие ровно шесть различных натуральных делителей. Для каждого найденного числа запишите эти шесть делителей в шесть соседних столбцов на экране с новой строки. Делители в строке должны следовать в порядке возрастания.
<p>Например, в диапазоне [12; 15] ровно шесть различных натуральных делителей имеет число 12, поэтому для этого диапазона вывод на экране должен содержать следующие значения:
<p>1 2 3 4 6 12</p></h3>
   <div class="spravca"><input type="checkbox" id="hd-2" class="reference"/>
<label for="hd-2" >Ответ и Решение</label> 
<span class="story">
   Решим задачу перебором. Будем проверять количество делителей каждого числа из диапазона, если их количество равно шести  — записываем их в двумерный массив d. После этого выводим эти делители на экран в новой строке.
   Пример решения в Python:
   <pre> for x in range(312614,312651+1):
    d = [1,x]
    k = 0
    for i in range (2,x//2+1):
        if x%i==0:
            d.append(i)
            k+=1
            if k>4:
                break
    if k==4:
        d.sort()
        print(*d)</pre>
  </body>
</html>
