<html>
   <link rel="stylesheet"  href="css.css">
<head>
<title>25 задание ЕГЭ</title>
  <ul class="menu-main">
  <li><a href="index.html">Главная</a></li>
  <li><a href="Mask.html" >Маски</a></li>
  <li><a href="delitel.html">Делители</a></li>
  <li><a href="Numbers.html" class="current">Задания</a></li>
  <li><a href="Info.html">Источники информации</a></li>
  </ul>  
  </head>
  <body bgcolor="#3b3934">
     <ul class="main-text">
        <h1>База заданий</h1>
        <h2>Номер 1</h2>
         <h3>
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [174457; 174505], числа, имеющие ровно два различных натуральных делителя, не считая единицы и самого числа. Для каждого найденного числа запишите эти два делителя в два соседних столбца на экране с новой строки в порядке возрастания произведения этих двух делителей. Делители в строке также должны следовать в порядке возрастания.
<p>Например, в диапазоне [5; 9] ровно два различных натуральных делителя имеют числа 6 и 8, поэтому для этого диапазона вывод на экране должна содержать следующие значения:
<p>2 3
<p>2 4
        </p>
<div class="spravca"><input type="checkbox" id="hd-1" class="reference"/>
<label for="hd-1" >Ответ и Решение</label> 
<span class="story">
Решим задачу перебором. Будем проверять количество делителей каждого числа из диапазона, если их количество равно двум  — записываем их в массив d.
Пример решения в Python:
<pre> for x in range(174457,174505+1):
    k=0
    s=[]
    for y in range(2,x//2+1):
        if x%y==0:
            k+=1
            s.append(y)
            if k>2:
                break
    if k==2:
        print(*s)</pre>
</span>

<div>
</h3>
<h2>Номер 2</h2>
<h3>Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [312614; 312651], числа, имеющие ровно шесть различных натуральных делителей. Для каждого найденного числа запишите эти шесть делителей в шесть соседних столбцов на экране с новой строки. Делители в строке должны следовать в порядке возрастания.
<p>Например, в диапазоне [12; 15] ровно шесть различных натуральных делителей имеет число 12, поэтому для этого диапазона вывод на экране должен содержать следующие значения:
<p>1 2 3 4 6 12</p></h3>
   <div class="spravca"><input type="checkbox" id="hd-2" class="reference"/>
<label for="hd-2" >Ответ и Решение</label> 
<span class="story">
   Решим задачу перебором. Будем проверять количество делителей каждого числа из диапазона, если их количество равно шести  — записываем их в двумерный массив d. После этого выводим эти делители на экран в новой строке.
   Пример решения в Python:
   <pre> for x in range(312614,312651+1):
    d = [1,x]
    k = 0
    for i in range (2,x//2+1):
        if x%i==0:
            d.append(i)
            k+=1
            if k>4:
                break
    if k==4:
        d.sort()
        print(*d)</pre>
</span>
   <h2>Номер 3</h2>
         <h3>
Найдите все натуральные числа, принадлежащие отрезку [101 000 000; 102 000 000], у которых ровно три различных чётных делителя (при этом количество нечётных делителей может быть любым). В ответе перечислите найденные числа в порядке возрастания.
        </p>
<div class="spravca"><input type="checkbox" id="hd-3" class="reference"/>
<label for="hd-3" >Ответ и Решение</label> 
<span class="story">
Заметим, что, поскольку необходимо найти чётные делители числа, можно не рассматривать нечётные числа из диапазона. Если число чётное, то 1 четный делитель у него уже есть, поэтому переменную count будем объявлять со значением 1. Находя очередной делитель числа, будем проверять, является ли этот делитель чётным, и, если является, будем прибавлять к переменной count единицу. Также заметим, что у каждого делителя числа есть парный делитель  — если он чётный, будем прибавлять к переменой count единицу. Также учтём то, что у числа может быть 2 одинаковых делителя (например, у числа 4 два одинаковых делителя  — числа 2 и 2).
Пример решения в Python:
<pre> for i in range(101000000, 102000000 + 1):
    if i % 2 == 0:
        count = 1
        sqrtI = round(i ** 0.5)
        for j in range(2, sqrtI + 1):
            if i % j == 0:
                if j % 2 == 0:
                    count += 1
                k = i // j
                if k % 2 == 0:
                    count += 1
                    if j == k:
                        count -= 1
                if count > 3:
                    break
        if count == 3:
            print(i)</pre>
</span>
<h2>Номер 4</h2>
          <h3>
Найдите все натуральные числа, принадлежащие отрезку [35 000 000; 40 000 000], у которых ровно пять различных нечётных делителей (количество чётных делителей может быть любым). В ответе перечислите найденные числа в порядке возрастания.
        </p>
<div class="spravca"><input type="checkbox" id="hd-4" class="reference"/>
<label for="hd-4" >Ответ и Решение</label> 
<span class="story">
Решим задачу перебором. Находя очередной делитель числа, будем проверять, является ли этот делитель нечётным, и, если является, будем прибавлять к переменной count единицу. Также заметим, что у каждого делителя числа есть парный делитель  — если он нечётный, будем прибавлять к переменой count единицу. Также учтём то, что у числа может быть 2 одинаковых делителя (например, у числа 9 два одинаковых делителя  — числа 3 и 3).
Пример решения в Python:
<pre>  def isPrime(n):
    r = n%2 + 1
    for i in range(r+1, int(n**0.5)+1, r):
        if n % i==0: return False
    return True
start, end = 35_000_000, 40_000_000
for i in range(start, end+1):
    n = i
    while n%2 == 0: n //= 2
    q = round(n**0.25)
    if n == q**4 and isPrime(q):
        print(i)
                    </pre>
</span>
   <h2>Номер 5</h2>
          <h3>
Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:

<p>— символ «?» означает ровно одну произвольную цифру;

<p>— символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.

<p>Например, маске 123*4?5 соответствуют числа 123405 и 12300405.

<p>Среди натуральных чисел, не превышающих 109, найдите все числа, соответствующие маске 12345?7?8, делящиеся на число 23 без остатка.

<p>В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце  — соответствующие им результаты деления этих чисел на 23.

<p>Количество строк в таблице для ответа избыточно.
        </p>
<div class="spravca"><input type="checkbox" id="hd-5" class="reference"/>
<label for="hd-5" >Ответ и Решение</label> 
<span class="story">
Решим задание с использованием функции fnmatch
<pre>for x in range(0,10**9,23):
    if fnmatch(str(x), '12345?7?8'):
        print(x, x//23)
                    </pre>
  <p> В результате работы программа должна вывести следующее:

<p>123450798 5367426

<p>123451718 5367466

<p>123453788 5367556

<p>123454708 5367596

<p>123456778 5367686

<p>123459768 5367816</p>
</span>
  </body>
</html>
